Revit 2027 API
PhotometricWebLightDistribution Class
 This class encapsulates a photometric web light distribution.
Inheritance Hierarchy
System.Object
 Autodesk.Revit.DB.Lighting.LightDistribution
 Autodesk.Revit.DB.Lighting.PhotometricWebLightDistribution
Namespace: Autodesk.Revit.DB.Lighting
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public class PhotometricWebLightDistribution : LightDistribution
Public Class PhotometricWebLightDistribution
	Inherits LightDistribution
public ref class PhotometricWebLightDistribution : public LightDistribution
type PhotometricWebLightDistribution =
    class
        inherit LightDistribution
    end
The PhotometricWebLightDistribution type exposes the following members.
Constructors
Name | Description
PhotometricWebLightDistribution(PhotometricWebLightDistribution) |  Creates a copy of the given photometric web light distribution
PhotometricWebLightDistribution(String, Double) |  Creates a photometric web light distribution object with the given filename and tilt.
Top
Properties
Name | Description
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from LightDistribution)
PhotometricWebFile |  The filename of an IES photometric web file.
TiltAngle |  The tilt angle.
Top
Methods
Name | Description
Clone |  Creates a copy of the LightDistribution derived object.
(Inherited from LightDistribution)
Dispose
(Inherited from LightDistribution)
Equals | Determines whether the specified object is equal to the current object.
(Inherited from Object)
GetHashCode | Serves as the default hash function.
(Inherited from Object)
GetType | Gets the Type of the current instance.
(Inherited from Object)
ToString | Returns a string that represents the current object.
(Inherited from Object)
Top
See Also
Reference
Autodesk.Revit.DB.Lighting Namespace